#1.      Задача «Часть от целого».
name = '«Сейчас на Земле появился новый вид роботов. Раньше их называли „железной оравой “, но это не очень точное определение».'
print (name [1:45])

#2.      Задача «Палиндром».
name = 'радар'
print (name[::-1])
name2 = 'норма'
print (name2[::-1])

#3.      Задача «Равные части».
a ='кенгуру'
print (a [4:7]+ a[0:4])

#4.      Задача «Четные и нечетные».
a = 'нейропрограммирование'
print (a [0:21:2]) # чет.
print (a [1:21:2]) # не чет.

#5.      Задача «Обратный порядок».
a2 = 'нейропластичность'
a3 = (a2 [::-1])
print (a3 [1:16:1])